Autodesk.Revit.DB.ParameterFilterUtilities.RemoveUnfilterableCategories(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Removes from the given set the categories that are not filterable.
categories:
The set of categories to check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ParameterFilterUtilities.IsParameterApplicable(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.ElementId)
Used to determine whether the element supports the given parameter.
Remarks:
This operation is supported for external (e.g., shared, project)
parameters only.
element:
The element to query for support of the given parameter.
parameter:
The parameter for which to query support.
Returns:
True if the element supports the given parameter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ParameterFilterUtilities.GetInapplicableParameters(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Returns the parameters that are not among the set of filterable
parameters common to the given categories.
aDoc:
The document containing the categories and parameters to query.
categories:
The categories that define the set of possibly filterable parameters.
parameters:
The parameters desired for use in a parameter filter.
Returns:
A list of parameters from the given array that are not valid
for use in a parameter filter with the given categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ParameterFilterUtilities.GetFilterableParametersInCommon(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Returns the filterable parameters common to the given categories.
Remarks:
A filterable category in Revit has a set of filterable parameters.
The filterable parameters common to a set of categories is the
intersection of all these filterable parameter sets.
This set defines the set of parameters that may be used to define
a rule on a ParameterFilterElement with a certain set of categories.
aDoc:
The document containing the categories and parameters to query.
categories:
The categories for which to determine the common parameters.
Returns:
The set of filterable parameters common to the given categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011